# Напишите программу вычисления значения функции 
# f(a, \, b) = 3(a + b)^3 + 275b^2 - 127a - 41

a = int(input())
b = int(input())

print(3*(a+b)**3 + 275*(b**2) - 127*a - 41)
